//Робота зі змінними
//1. Створіть змінні a = 10 і b = 2. Виведіть на екран їх суму, різницю, добуток і частку (результат ділення).
let a = 10;
let b = 2;
let abResult = "";
abResult += "a + b = " + (a+b).toString()+"\n";
abResult += "a - b = " + (a-b).toString()+"\n";
abResult += "a * b = " + (a*b).toString()+"\n";
abResult += "a / b = " + (a/b).toString()+"\n";
console.log("Задание 1:\n" + abResult);
//2. Створіть змінні a = 17 і b = 10. Відніміть від a змінну b і результат надайте змінної c. Потім створіть змінну d, надайте їй значення 7. Складіть змінні c і d, а результат запишіть в змінну result. Виведіть на екран значення змінної result.
a = 17;
b = 10;
let c = a - b;
let d = 7;
let result = c + d;
console.log("Задание 2: " + result);
//3. Створіть три змінні - година, хвилина, секунда. З їх допомогою виведіть поточний час в форматі 'година: хвилина: секунда'.
let today = new Date();
let second = today.getSeconds();
let minute = today.getMinutes();
let hour = today.getHours();
console.log("Задание 3: Секунд " + second + ", Минут " + minute + ", Часов " + hour);
//Робота з рядками. функція prompt 
//4. Створіть змінні text1 = 'Привіт,' і text2 = 'Мир!'. За допомогою цих змінних і операції додавання рядків виведіть на екран фразу 'Привіт, світ!'.
let text1 = 'Привіт, ';
let text2 = 'Мир!';
console.log("Задание 4: " + text1 + text2);
//5. Створіть змінну name і надайте їй ваше ім'я. Виведіть на екран фразу 'Привіт,% Ім'я%!'.
let name = "Кирилл";
console.log("Задание 5: " + text1 + name);
//6. Створіть змінну age і надайте їй ваш вік. Виведіть на екран 'Мені% Вік% років!'
let age = 18;
console.log("Задание 6: Мне " + age + " лет");
//7. Запитайте ім'я користувача за допомогою методи prompt. Виведіть за допомогою alert повідомлення 'Ваше ім'я% ім'я%'.
let nameAnswer = prompt("Введите ваше имя: ", name);
console.log("Задание 7: Ваше имя " + nameAnswer);
//8. Запитайте у користувача число. Виведіть за допомогою alert квадрат цього числа.
let numberAnswer = prompt("Введите число: ", a);
console.log("Задание 8: Квадрат введенного числа " + numberAnswer.toString() + " ^ 2 = " + (numberAnswer**2).toString());
alert("Задание 8: Квадрат введенного числа " + numberAnswer + " ^ 2 = " + numberAnswer**2);
//9. Створіть змінну text і надайте їй значення 'abcde'. Звертаючись до окремих символів цього рядка виведіть на екран символ 'a', символ 'c', символ 'e'.
let text = 'abcde';
result = "Задание 9:\n";
for (let i = 0; i < text.length; ++i)
{
    result += 'Символ: ' + text[i] + '\n';
}
console.log(result);
//10. Створіть змінну num і надайте їй значення '12345'. Знайдіть твір (множення) цифр цього числа.
let num = '12345';
result = 1;
for (let i = 0; i < num.length; ++i)
{
    result *= num[i];
}
console.log("Задание 10: произведение чисел строки: " + num + " равно " + result);
//Робота з масивами
//11. Дан масив з елементами 'Привіт,', 'світ' і '!'. Необхідно записати в змінну text фразу 'Привіт, світ!', А потім вивести на екран вміст цієї змінної.
let arrayData = ['Привіт,', 'світ', '!'];
text = "";
for (let i = 0; i < arrayData.length; ++i)
{
    text += arrayData[i] + ' ';
}
console.log("Задание 11: " + text);
//12. Створіть масив arr = [ 'a', 'b', 'c']. Виведіть його на екран за допомогою функції alert. Виведіть на екран вміст першого і третього елементів.
let arr1 = [ 'a', 'b', 'c'];
alert("Задание 12: " + arr1);
console.log("Задание 12: " + arr1 + "\nПервый элемент: " + arr1[0] + "\nПоследний элемент: " + arr1[arr1.length - 1]);
//13. Створіть масив arr = [ 'a', 'b', 'c', 'd'] і з його допомогою виведіть на екран рядок 'a + b, c + d'
arr1 = [ 'a', 'b', 'c', 'd'];
console.log("Задание 13: arr1 = " + arr1 + ":\n'a + b, c + d' = " + arr1[0] + arr1[1] + ", " + arr1[2] + arr1[3]);
//14. Створіть масив arr з елементами 2, 5, 3, 9. Помножте перший елемент масиву на другий, а третій елемент на четвертий. Результати складіть, надайте змінної result. Виведіть на екран значення цієї змінної
let arr2 = [2, 5, 3, 9];
result = 1;
for (let i = arr2.length - 1; i >= 0; --i)
    result *= arr2[i];
console.log("Задание 14: arr2 = " + arr2 + "\n arr2[0] * arr2[1] + arr2[2] * arr2[3] = " + result);
//15. Створіть об'єкт obj. Виведіть на екран елемент з ключем 'c' двома способами: через квадратні дужки і як властивість об'єкта: var obj = {a: 1, b: 2, c: 3};
let obj = { a: 1, b: 2, c: 3 };
console.log("Задание 15: obj.c = " + obj.c + "\nobj['с'] = " + obj["c"]);
//16. Створіть масив заробітних плат obj. Виведіть на екран зарплату Петі і Колі.
obj = {Петя: 88005553535, Коля: 53535550088};
console.log("Задание 16: obj.Коля = " + obj.Коля + "\nobj.Петя = " + obj.Петя);
//17. Створіть об'єкт з днями тижня. Ключами в ньому повинні служити номера днів від початку тижня (понеділок - перший і т.д.). Виведіть на екран поточний день тижня. Нехай тепер номер дня тижня зберігається в змінної day, наприклад там лежить число 3. Виведіть день тижня, відповідний значенню змінної day.
let dayOfWeek = {1: "Понедельник", 2: "Вторник", 3: "Среда", 4: "Четверг", 5: "Пятница", 6: "Суббота", 7: "Воскресенье"};
let day = prompt("Введите номер дня недели: ", 3);
console.log("Задание 17: введенный номер " + day + ", dayOfWeek['" + day + "'] = " + dayOfWeek[day]);
//18. Дан масив [[1, 2, 3], [4, 5, 6], [7,8,9]]. Виведіть на екран цифру 4 з цього масиву.
arr2 = [[1, 2, 3], [4, 5, 6], [7, 8, 9]];
console.log("Задание 18: arr2[1][0] = " + arr2[1][0]);
//19. Дан об'єкт {js: [ 'jQuery', 'Angular'], php: 'hello', css: 'world'}. Виведіть з його допомогою слово 'jQuery'.
obj = { js: [ 'jQuery', 'Angular'], php: 'hello', css: 'world'};
console.log("Задание 19: obj.js[0] = " + obj.js[0] + "\nobj[js][0] = " + obj["js"][0]);
//20. Створіть двомірний масив. Перші два ключа - це 'ru' і 'en'. Нехай перший ключ містить елемент, який є масивом назв днів тижня по-російськи, а другий - по-англійськи. Виведіть за допомогою цього масиву понеділок-російськи і середу по англійськи (нехай понеділок - це нульовий день). Нехай тепер у змінній lang зберігається мову (вона приймає одне із значень або 'ru', або 'en' - або те, або те), а в змінної day - номер дня. Виведіть словом день тижня, відповідний змінним lang і day. Тобто: якщо, наприклад, lang = 'ru' і day = 3 - то виведемо 'среда ".
obj = {ru: {1: "Понедельник", 2: "Вторник", 3: "Среда", 4: "Четверг", 5: "Пятница", 6: "Суббота", 7: "Воскресенье"}, en: {1: "Monday", 2: "Tuesday", 3: "Wednesday", 4: "Thursday", 5: "Friday", 6: "Saturday", 7: "Sunday"}};
let lang = prompt("Введите язык (ru/en)", "en");
day = prompt("Введите день недели (ru/en)", 3);
console.log("Задание 20: obj[lang][day] = " + obj[lang][day]);
//Завдання на конструкції if-else, switch-case
//21. У змінної day лежить якесь число з інтервалу від 1 до 31. Визначте в яку декаду місяця потрапляє це число (в першу, другу або третю).
day = prompt("Введите день месяца", 27);
result = "day находится в ";
if (day > 10)
{
    if (day > 20) { result += "3"; }
    else { result += "2"; }
}
else { result += "1"; }
result += " декаде";
console.log("Задание 21: " + result);
//22. У змінної month лежить якесь число з інтервалу від 1 до 12. Визначте в яку пору року потрапляє цей місяць (зима, літо, весна, осінь).
month = prompt("Введите номер месяца", 6);
result = "month - ";
if (month >= 3 && month <= 11)
{
    if (month >= 9) { result += "осенний"; }
    else {
        if (month >= 6) { result += "летний"; }
        else { result += "весенний"; }
    }
}
else {
    result += "зимний";
}
result += " месяц";
console.log("Задание 22: " + result);
//23. У змінної year зберігається рік. Визначте, чи є він високосним (в такому році є 29 лютого). Рік буде високосним в двох випадках: або він ділиться на 4, але при цьому не ділиться на 100, або ділиться на 400. Так, роки 1700, 1800 і 1900 не є високосними, так як вони діляться на 100 і не діляться на 400. роки 1600 і 2000 - високосні, так як вони діляться на 400.
let year =  prompt("Введите год", 1283);
if (year % 4 == 0 && year % 100 != 0)
    console.log("Задание 23: " + year + " - высокосный год");
else
    console.log("Задание 23: " + year + " - не высокосный год");
//24. Дана рядок з цифрами, наприклад, '12345'. Перевірте, що першим символом цього рядка є цифра 1, 2 або 3. Якщо це так - виведіть "так", в іншому випадку виведіть "ні".
let numbersRow = "12345";
let rowAnswer = "ні";
switch (parseInt(numbersRow[0]))
{
    case 1: case 2: case 3:
        { rowAnswer = "так"; }; break;
}
console.log("Задание 24: " + numbersRow + " " + rowAnswer);
//25. Дана рядок з 3-х цифр. Знайдіть суму цих цифр. Тобто складіть як числа перший символ рядка, другий і третій.
numbersRow = "123";
let rowSum1 = 0;
for (let i = numbersRow.length - 1; i >= 0; --i)
    rowSum1 += parseInt(numbersRow[i]);
console.log("Задание 25: Sum('" + numbersRow + "') = " + rowSum1);
//26. Дана рядок з 6-ти цифр. Перевірте, що сума перших трьох цифр дорівнює сумі друге трьох цифр. Якщо це так - виведіть "так", в іншому випадку виведіть "ні".
numbersRow = "123456";
rowAnswer = "ні";
rowSum1 = 0;
rowSum2 = 0;
for (let i = 0; i < numbersRow.length; ++i)
{
    if (i <= numbersRow.length / 2)
        rowSum1 += parseInt(numbersRow[i]);
    else
        rowSum2 += parseInt(numbersRow[i]);
}
if (rowSum1 == rowSum2)
    rowAnswer = "так";
console.log("Задание 26: " + numbersRow + " " + rowAnswer);
//27. Дана рядок. Вона може починатися з http: // або не починати. Приклад такого рядка 'http://ilovephp.net'. Завдання: перевірте те, що рядок починається з http: //. Якщо це так - виведіть "так", в іншому випадку виведіть "ні".
//Робота з циклами while, for, for-in
numbersRow = 'http://ilovephp.net';
let searchRow = 'http://';
let rowFlag = true;
rowAnswer = "ні";
if (searchRow.length >= numbersRow.length)
    for (let i = 0; i < searchRow.length; ++i)
        if (numbersRow[i] != searchRow[i])
            rowFlag = false;
if (rowFlag)
    rowAnswer = "так";
console.log("Задание 27: " + numbersRow + " " + rowAnswer);
//28. Виведіть стовпець парних чисел в проміжку від 0 до 100.
numbersRow = "";
for (let i = 0; i <= 100; ++i)
    if(!(i % 2))
        numbersRow += " " + i;
console.log("Задание 28: " + numbersRow);
//29. За допомогою циклу знайдіть суму чисел від 1 до 100.
rowSum1 = 0;
for (let i = 0; i <= 100; ++i)
    rowSum1 += i;
console.log("Задание 29: " + rowSum1);
//30. Дан масив з елементами [1, 2, 3, 4, 5]. За допомогою циклу for знайдіть суму елементів цього масиву. Запишіть її в змінну result
result = 0;
arr2 = [1,2,3,4,5];
for (let i = arr2.length - 1; i >= 0; --i)
    result += arr2[i];
console.log("Задание 30: "+ arr2 + "; " + result);
//31. Дан об'єкт obj. За допомогою першого циклу for-in виведіть на екран ключі, за допомогою другого - елементи. var obj = {green: 'зелений', red: 'червоний', blue: 'блакитний'}
obj = {green: 'зелений', red: 'червоний', blue: 'блакитний'};
let keysArr = Object.keys(obj);
let elemArr = Object.values(obj);
console.log("Задание 31: " + keysArr + "; " + elemArr);
//32. Дан об'єкт obj з ключами Коля, Вася, Петя з елементами '200', '300', '400'. За допомогою циклу for-in виведіть на екран рядки такого формату: 'Коля - зарплата 200 доларів.'.
obj = {Коля: 200, Вася: 300, Петя: 400};
keysArr = Object.keys(obj);
elemArr = Object.values(obj);
let outputRow = "";
for (let i = 0; i < keysArr.length; ++i)
    outputRow += keysArr[i] + " - зарплата " + elemArr[i] + " доларів; ";
console.log("Задание 32: " + outputRow);
//33. Дан масив з елементами 2, 5, 9, 15, 0, 4. За допомогою циклу for і оператора if виведіть на екран стовпець тих елементів масиву, які більше 3-х, але менше 10
arr2 = [2, 5, 9, 15, 0, 4];
outputRow = "";
for (let iterator in arr2)
    if (iterator > 3 && iterator < 10)
        outputRow += "[" + iterator + "] ";
console.log("Задание 33: " + arr2 + "; " + outputRow);
//34. Дан масив з числами. Числа можуть бути позитивними і негативними. Знайдіть суму позитивних елементів масиву і твір негативних
arr2 = [-5,-4,-3,-2,-1,1,2,3,4,5];
let Sum = 0;
let Mult = 1;
for (let i = arr2.length - 1; i >=0; --i){
    Sum += arr2[i];
    Mult *= arr2[i];
}
console.log("Задание 34: " + arr2 + "; Sum: " + Sum + "; Mult: " + Mult);
//35. Дан масив числами, наприклад: [10, 20, 30, 50, 235, 3000]. Виведіть на екран тільки ті числа з масиву, які починаються на цифру 1, 2 або 5.
arr1 = ['10', '20', '30', '50', '235', '3000'];
outputRow = [];
for (let i = arr1.length - 1; i >=0; --i)
{
    switch (arr1[i][0]){
        case '1': case '2': case '5':
        outputRow.push(arr1[i]); break;
        default:
        outputRow.push("-&-");
    }
}
console.log("Задание 35: " + arr1 + "; " + outputRow);
//36. Складіть масив днів тижня. За допомогою циклу for виведіть всі дні тижня, а вихідні дні виведіть жирним. А поточний день виведіть курсивом. Поточний день повинен зберігатися у змінній day.
arr1 = [
    'Воскресенье',
    'Понедельник',
    'Вторник',
    'Среда',
    'Четверг',
    'Пятница',
    'Суббота'];
var curDate = new Date();
day = curDate.getDay() % 7;
console.log("Задание 36:\n");
for (let i = 0; i < arr1.length; ++i)
{
    if (i == day){
        console.log(arr1[i].italics()+"\n");
    } else if (i < 6){
        console.log(arr1[i]+"\n");
    } else{
        console.log(arr1[i].bold()+"\n");
    }
}
//37. Дано число n = 1000. Делите його на 2 стільки раз, поки результат ділення не стане менше 50. Яке число вийде? Порахуйте кількість ітерацій, необхідних для цього (ітерація - це прохід циклу), і запишіть його в змінну num.
let n = 1000;
num = 0;
while (n>50){
    n /= 2;
    ++num;
}
console.log("Задание 37: n=1000; while n>50 n/=2; n:" + n + "; num:" + num + ";");
//Завдання на математичні функції
//38. Дано змінні a і b. Перевірте, що a ділиться без залишку на b. Якщо це так - виведіть 'Ділиться' і результат ділення, інакше виведіть 'Ділиться з залишком' і залишок від ділення.
a = prompt("Введите a", 500);
b = prompt("Введите b", 13);
c = a % b;
rowAnswer = "Ділиться із залишком " + c;
if (!c){
    rowAnswer = "Ділиться без залишку";
}
console.log("Задание 38: a%b=" + a + "%" + b + "=" + c + "; " + rowAnswer);
//39. Дано змінні a і b. Відніміть від a змінну b і результат надайте змінної c. Зробіть так, щоб в будь-якому випадку в змінну c записалося позитивне значення. Перевірте роботу скрипта при a і b, рівних відповідно 3 і 5, 6 і 1.
a = prompt("Введите a", 13);
b = prompt("Введите b", 500);
c = Math.abs(a - b);
console.log("Задание 39: |a-b|=|" + a + "-" + b + "|=" + c + ";");
//40. Дан масив з елементами 4, 2, 5, 19, 13, 0, 10. Знайдіть квадратний корінь з суми кубів його елементів. Для вирішення скористайтеся циклом for.
arr2 = [4, 2, 5, 19, 13, 0, 10];
Sum = 0;
for (let i = 0; i < arr2.length; ++i){
    Sum += Math.pow(parseInt(arr2[i], 10), 3);
}
Sum = Math.sqrt(Sum);
console.log("Задание 40: корінь суми кубів елементів arr2: " + arr2 + " : " + Sum);
//41. Знайдіть квадратний корінь з 379. Результат округлите до цілих, до десятих, до сотих.
a = Math.sqrt(379).toFixed(0);
b = Math.sqrt(379).toFixed(1);
c = Math.sqrt(379).toFixed(2);
console.log("Задание 41: sqrt(379): " + a + ", " + b + ", " + c);
//42. Знайдіть квадратний корінь з 587. Округлите результат в більшу і меншу сторони, запишіть результати округлення в об'єкт з ключами 'floor' і 'ceil'.
obj = {floor: .0, ceil: .0};
obj[0] = Math.floor(Math.sqrt(587));
obj[1] = Math.ceil(Math.sqrt(587));
console.log("Задание 42: sqrt(587): " + obj[0] + ", " + obj[1]);
//43. Заповніть масив 10-ю випадковими цілими числами. Виведіть на екран вміст масиву
arr2 = [];
for (let i = 0; i < 10; ++i){
    arr2[i] = Math.floor(Math.random() * 1000000);
}
console.log("Задание 43: rand[10]: " + arr2);
//44. Напишіть скрипт, який буде знаходити факторіал числа. Факторіал (позначається!) - це добуток всіх цілих чисел, менше даного, і його самого. Наприклад, 4! = 1 * 2 * 3 * 4.
n = prompt("Введите n", 20);
a = 1;
for (let i = n; i > 1; --i){
    a *= i;
}
console.log("Задание 44: " + n + "! = " + a);
//45. Напишіть скрипт, який перевіряє, чи є дане число простим (просте число - це те, яке ділиться тільки на 1 і на саме себе).
n = prompt("Введите n", 7333);
arr2 = [];
for (let i = n; i > 0; --i){
    if (n % i == 0){
        arr2.push(i);
    }
}
rowAnswer = " - простое число";
if (arr2.length > 2){
    rowAnswer = " делится на: " + arr2;
}
console.log("Задание 45: " + n + rowAnswer);
//46. Напишіть скрипт, який знайде всі прості числа в заданому проміжку. Перевірте його роботу на проміжку від 1 до 1000.
a = 1;
b = 1000;
arr2 = [];
var arr3 = [];
for (let i = b; i >= a; --i){
    arr3 = [];
    for (let j = i; j > 0; --j){
        if (!(i % j)){
            arr3.push(j);
        }
    }
    if (arr3.length == 2){
        arr2.push(i);
    }
}
console.log("Задание 46: простые числа от " + a + " до " + b + ": " + arr2);
//47. Напишіть скрипт, який буде розкладати заданий число на прості множники.
n = prompt("Введите n", 7332);
arr2 = [];
a = n;
var condition = a / 2;
for (var i = 2; i <= condition; ++i) {
    b = a % i;
    while (!b){
        a /= i;
        arr2.push(i);
        b = a % i;
    }
}
if (a != 1){
    arr2.push(a);
}
console.log("Задание 47: разложение на простые множители числа " + n + ": " + arr2);